$CharacterEncoding = "UTF-8";
(*
解答
問1の解：{{1,3,2,4,1},5+2 Sqrt[5]+Sqrt[13]}
問2の解：{{1,4,6,7,5,2,3,8,1},2 Sqrt[2]+180 Sqrt[389704821907538508955734578]+140 Sqrt[408122785795383271863890833]+30 Sqrt[44423752197226396120441611101]+18 Sqrt[107181545599272469494027367213]+4 Sqrt[2780629972038062330362700160745]+2 Sqrt[5361924839307246851553707701429]+2 Sqrt[12676005138417245898310114646629]}
問3の解：{{1,3,4,8,9,7,2,6,10,5,1},2 Sqrt[2]+64 Sqrt[374592887722437594560649745]+120 Sqrt[8878580727371825569013149397]+34 Sqrt[155182559103498897847728835237]+10 Sqrt[442054143557969245013690634161]+6 Sqrt[2181468662163198711246278958962]+6 Sqrt[3350812650350370366471729847985]+2 Sqrt[10165314875220362185468227297241]+2 Sqrt[17391493709805865400206342924045]+2 Sqrt[25803999090935871897082742422613]}
問4の解：{{1,7,5,3,9,10,4,8,2,6,11,12,1},2 Sqrt[2]+34 Sqrt[3195369967556927713880748928417]+12 Sqrt[3772419523693959603049102022509]+2 Sqrt[160484038024165801477859759960914]+2 Sqrt[612083269007210583844797970541858]+2 Sqrt[1033971002910991184307532127380117]+2 Sqrt[1722507462662758380164246475260765]+2 Sqrt[1792530133543853914103386055935333]+2 Sqrt[2500272048298463810923203133560101]+2 Sqrt[3273635230878349778860543561040585]+2 Sqrt[4432906362410890393095987348509365]+2 Sqrt[4820910367138062300242380548837241]}

実行環境
プラットフォーム：Windows 8.1 64 bit
処理系：Mathematica 10.0.1
CPU：Core i7-4930K
メモリ：64GB
計算時間（秒）：37

環境構築方法
1. Mathematicaをインストールする。

実行方法
1. ファイル名を「tsp.m」とする。
2. コマンドプロンプトで「C:\Program Files\Wolfram Research\Mathematica\10.0\wolfram.exe" < tsp.m」を実行する。
*)
search[cities_] := 
 Module[{min, travel, d, minDistance = Infinity, shortEdges, format},
  (*巡回路群を{経路,経路長}のリストで表現する*)
  (*巡回路がなければ経路長は無限大ということにする*)
  min[{}] = {{}, Infinity};
  (*巡回路群の中から経路長（2番目の要素）の最小値を探し、該当する巡回路を返す*)
  min[tours_] := First[Cases[tours, {_, Min[tours[[;; , 2]]]}, 1]];
  
  (*2点間の距離の計算法の定義。一度計算したら記憶する*)
  d[a_, b_] := d[a, b] = Norm[cities[[a]] - cities[[b]]];
  
  (*エッジを短い順に並べておく*)
  shortEdges = Sort[Flatten[Table[d[i, j], {i, 1, Length[cities] - 1}, {j, i + 1, Length[cities]}]], Less];
  
  (*travel[すでに通過した点のリスト, それまでの経路長, まだ通過していない点のリスト]*)
  (*通過していない点が無くなったら、始点までの距離を追加し、暫定最短巡回路長を更新する*)
  travel[visited_, len_, {}] :=
   With[{x = len + d[Last[visited], First[visited]]},
    If[x < minDistance, minDistance = x];
    {visited, x}];
  
  travel[visited_, len_, remain_] :=
   (*残りのステップが最短だったとしても暫定巡回路長より長いなら、これ以上調べる必要は無い*)
   If[len + Sum[shortEdges[[i]], {i, 1, Length[remain] + 1}] > minDistance, {{}, Infinity},
    min[Map[
      travel[(*再帰的に探索する*)
        (*問題の条件を使って探索範囲を狭めるため、最初の点の次に最後の点を調べる*)
        If[Length[visited] == 1, Prepend, Append][visited, #],
        len + d[Last[visited], #],
        DeleteCases[remain, #]] &,
      (*すでに通過した点が2つ、つまり最初の点と最後の点のとき、次に調べる点の候補は最後の点より小さいもののみ*)
      If[Length[visited] == 2, Select[remain, # < First[visited] &], remain]]]];
  
  (*最後に経路の先頭を1にして、最後に1を追記する*)
  format[{visited_, len_}] := {Append[RotateLeft[visited], 1], len};
  
  (*探索開始*)
  format[travel[{1}, 0, Range[2, Length[cities]]]]]

example = {{4, 5}, {7, 2}, {9, 1}, {9, 4}, {7, 3}, {6, 8}};

q1 = {{6, 2}, {4, 6}, {3, 4}, {6, 7}};

q2 = {
    {9007199254742147, 18014398509481729},
    {12756043757992973, 9682416912451847},
    {7757599369284503, 13555003989651347},
    {6644379103590211, 16459957280325781},
    {7107267045169859, 11361149298161843},
    {17193260969299, 17215263416918057},
    {374711875842439, 13679925148827797},
    {9007199254742149, 18014398509481727}};

q3 = {
    {24450478250354407, 24162405956350007},
    {5022777106905113, 9351872806120363},
    {22646143480201399, 18046391278629037},
    {26904592918639433, 8822422244422001},
    {13510798882112671, 27021597764225159},
    {7416604674633347, 17884308649058737},
    {11322174193520947, 3885286011386431},
    {25871043906094921, 9505143934995377},
    {12509125559334347, 10427194051934741},
    {13510798882112669, 27021597764225161}};

q4 = {
    {143440002785145229, 125304038892333277},
    {264428432131034503, 120015772829769617},
    {128790875003948837, 270669230395068511},
    {159528435868345829, 204968426098505873},
    {19849988012900029, 184555790037852601},
    {275289191011264097, 71741794408943803},
    {10351044942542977, 120950333572309643},
    {256393278357970813, 144044348649819451},
    {144115188075856001, 288230376151712791},
    {144115188075856003, 288230376151712789},
    {219455401629103741, 10320154786742321},
    {227161482167126027, 70606670735479337}};

Print[search[example]];
Print[search[q1]];
Print[search[q2]];
Print[search[q3]];
Print[search[q4]];
